In [1]:
import pandas as pd
import numpy as np

# GroupBy Medhanics

In [ ]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})

In [2]:
df

  key1 key2     data1     data2
0    a  one  1.519421 -1.283417
1    a  two  2.589025  1.036169
2    b  one  0.648761  1.301099
3    b  two -0.230656  0.804182
4    a  one -0.139799 -1.407952

In [7]:
grouped = df['data1'].groupby(df['key1'])

In [8]:
grouped

In [9]:
grouped.mean()

  key1     data1
0    a  1.322883
1    b  0.209053

In [10]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean().reset_index()

In [11]:
means

  key1 key2     data1
0    a  one  0.689811
1    a  two  2.589025
2    b  one  0.648761
3    b  two -0.230656